Repository: Anatolii29/itea_hometask_4
Catalog: itea_hometask_4/localization/*.lproj/Localizable.strings
Languages: uk

# Внимание
source: ATTENTION
uk: Увага

# OK
source: Good
uk: Добре

# Имя
source: Name
uk: Имья

# Фамилия
source: Surname
uk: Призвище

# Город
source: City
uk: Мисто

# Курс
source: Course
uk: Курс

# Фото
source: Photo
uk: Фото

# Возраст
source: Age
uk: Вик

# Не заполнены поля:
source: Fields are empty:
uk: Не заповнени поля:

# Поле возраст не соответствует числу
source: Age field is not a Iteger value
uk: Поле вик не видповидае числу
